SSD Performance Profiling/Baseline/fio_output.txt
randread_4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
randwrite_4k: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
seqread_128k: (g=2): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
seqwrite_128k: (g=2): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.28
Starting 4 processes

randread_4k: (groupid=0, jobs=1): err= 0: pid=7973: Mon Sep 29 23:10:22 2025
  read: IOPS=1834, BW=7338KiB/s (7514kB/s)(215MiB/30001msec)
    slat (nsec): min=1052, max=261632, avg=7596.74, stdev=6447.88
    clat (usec): min=256, max=9698, avg=534.62, stdev=123.26
     lat (usec): min=259, max=9718, avg=542.38, stdev=123.85
    clat percentiles (usec):
     |  50th=[  545],  95th=[  717],  99th=[  758]
    lat percentiles (usec):
     |  50th=[  553],  95th=[  725],  99th=[  766]
   bw (  KiB/s): min= 6733, max= 7712, per=100.00%, avg=7345.97, stdev=217.96, samples=59
   iops        : min= 1683, max= 1928, avg=1836.39, stdev=54.48, samples=59
  lat (usec)   : 500=42.03%, 750=56.69%, 1000=1.24%
  lat (msec)   : 2=0.04%, 10=0.01%
  cpu          : usr=1.36%, sys=3.43%, ctx=55882, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=55034,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randwrite_4k: (groupid=1, jobs=1): err= 0: pid=7979: Mon Sep 29 23:10:22 2025
  write: IOPS=327, BW=1312KiB/s (1343kB/s)(38.4MiB/30001msec); 0 zone resets
    slat (nsec): min=1256, max=163016, avg=17706.08, stdev=10503.86
    clat (usec): min=706, max=31683, avg=3025.49, stdev=2778.74
     lat (usec): min=712, max=31704, avg=3043.51, stdev=2778.65
    clat percentiles (usec):
     |  50th=[ 1336],  95th=[ 8291],  99th=[10683]
    lat percentiles (usec):
     |  50th=[ 1369],  95th=[ 8291],  99th=[10683]
   bw (  KiB/s): min= 1010, max= 1611, per=99.94%, avg=1312.00, stdev=135.28, samples=59
   iops        : min=  252, max=  402, avg=327.85, stdev=33.82, samples=59
  lat (usec)   : 750=0.69%, 1000=28.14%
  lat (msec)   : 2=24.03%, 4=20.23%, 10=25.44%, 20=1.16%, 50=0.32%
  cpu          : usr=0.43%, sys=1.36%, ctx=10461, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9839,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
seqread_128k: (groupid=2, jobs=2): err= 0: pid=7985: Mon Sep 29 23:10:22 2025
  read: IOPS=65, BW=8351KiB/s (8551kB/s)(245MiB/30073msec)
    slat (usec): min=7, max=110211, avg=197.72, stdev=4253.95
    clat (usec): min=1557, max=138387, avg=15120.11, stdev=19505.53
     lat (usec): min=1569, max=222717, avg=15318.26, stdev=20466.91
    clat percentiles (msec):
     |  50th=[   11],  95th=[   44],  99th=[  114]
    lat percentiles (msec):
     |  50th=[   11],  95th=[   44],  99th=[  115]
   bw (  KiB/s): min=  768, max=12774, per=100.00%, avg=8366.50, stdev=4415.91, samples=60
   iops        : min=    6, max=   99, avg=65.35, stdev=34.49, samples=60
  write: IOPS=65, BW=8339KiB/s (8539kB/s)(245MiB/30069msec); 0 zone resets
    slat (usec): min=11, max=3857, avg=37.83, stdev=198.87
    clat (msec): min=6, max=137, avg=15.30, stdev=19.85
     lat (msec): min=6, max=137, avg=15.34, stdev=19.85
    clat percentiles (msec):
     |  50th=[   11],  95th=[   44],  99th=[  114]
    lat percentiles (msec):
     |  50th=[   11],  95th=[   44],  99th=[  114]
   bw (  KiB/s): min= 1023, max=12288, per=100.00%, avg=8354.13, stdev=4396.30, samples=60
   iops        : min=    7, max=   96, avg=65.27, stdev=34.35, samples=60
  lat (msec)   : 2=0.08%, 4=0.08%, 10=38.64%, 20=53.69%, 50=3.67%
  lat (msec)   : 100=0.36%, 250=3.49%
  cpu          : usr=0.15%, sys=0.27%, ctx=4048, majf=0, minf=66
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1962,1959,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7338KiB/s (7514kB/s), 7338KiB/s-7338KiB/s (7514kB/s-7514kB/s), io=215MiB (225MB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=1312KiB/s (1343kB/s), 1312KiB/s-1312KiB/s (1343kB/s-1343kB/s), io=38.4MiB (40.3MB), run=30001-30001msec

Run status group 2 (all jobs):
   READ: bw=8351KiB/s (8551kB/s), 8351KiB/s-8351KiB/s (8551kB/s-8551kB/s), io=245MiB (257MB), run=30073-30073msec
  WRITE: bw=8339KiB/s (8539kB/s), 8339KiB/s-8339KiB/s (8539kB/s-8539kB/s), io=245MiB (257MB), run=30069-30069msec

Disk stats (read/write):
  sda: ios=57141/11796, merge=0/0, ticks=56565/58303, in_queue=114869, util=95.05%